Revit 2027 API
BuiltInFailures.LevelAssociationFailures Class
 Failures about Level association of Analytical Node.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.LevelAssociationFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class LevelAssociationFailures
Public NotInheritable Class LevelAssociationFailures
public ref class LevelAssociationFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type LevelAssociationFailures = class end
The BuiltInFailures.LevelAssociationFailures type exposes the following members.
Properties
Name | Description
AllLevelsDeleted |  All Levels from model were deleted
Top
See Also
Reference
Autodesk.Revit.DB Namespace